/**
 * Created by nielei on 2018/6/14.
 */

// 导出模块后台node使用
module.exports = {
    serverNe: {
        '0x0201': '重车衡',
        '0x0202': '轻车衡',
        '0x0203': '皮带采样机',
        '0x0204': '汽车采样',
        '0x0205': '火车采样',
        '0x0206': '原煤传输',
        '0x0207': '制样机',
        '0x0208': '下料仓',
        '0x0209': '预备仓',
        '0x020a': '天平',
        '0x020b': '破碎机',
        '0x0210': '存样柜',
        '0x0211': '化验',
        '0x0212': '火车计量',
        '0x0213': '入炉采样',
        '0x0214': '火车识别',
    },
    devicesNe: {
        // 运输线
        '0x71': {
            '0x7101': '火车出入厂识别装置',
            '0x7102': '火车衡器',
            '0x7103': '火车采机识别装置',
            '0x7104': '火车翻车识别装置',
            '0x7105': '火车轻车识别装置',
            '0x7106': '火车翻车机',
            '0x7107': '火车采样机',
            '0x7108': '汽车无人值守装置',
            '0x7109': '汽车厂前无人值守装置',
            '0x710a': '火车翻车机',
            '0x710b': '汽车入厂无人值守装置',
            '0x710c': '汽车重车无人值守装置',
            '0x710d': '汽车煤场无人值守装置',
            '0x710e': '汽车轻车无人值守装置',
            '0x710f': '汽车出厂无人值守装置',
            '0x7110': '汽车采样机',
            '0x7111': '船运采样机',
        },

        // 燃煤线
        '0x72': {
            '0x7201': '入厂采样机',
            '0x7202': '入炉采样机',
            '0x7203': '输煤程控',
            '0x7204': '皮带秤',
            '0x7205': '斗轮机',
            '0x7206': '斗轮机定位装置',
            '0x7207': '煤场测温装置',
        },

        // 样品线
        '0x73': {
            '0x7301': '原煤集样装置',
            '0x7302': '原煤封样装置',
            '0x7303': '原煤缓存装置',
            '0x7304': '原煤转运车',
            '0x7305': '原煤动力控制柜',
            '0x7306': '原煤卸料装置',
            '0x7307': '全自动制样机',
            '0x7308': '存样柜',
            '0x7309': '样瓶动力控制柜',
            '0x730a': '取样终端',
            '0x730b': '钥匙管理机',
            '0x730c': '在线全水仪',
            '0x730d': '弃料回收装置',
            '0x730e': '弃样车',
            '0x730f': '样瓶清洗装置',
            '0x7310': '原煤上料装置',
        },

        // 化验室
        '0x75': {
            '0x7501': '温湿度装置',
            '0x7502': '电子天平',
            '0x7503': '全水仪',
            '0x7504': '工分仪',
            '0x7505': '量热仪',
            '0x7506': '测硫仪',
            '0x7507': '测氢仪',
        },

        // 网络综合
        '0x76': {
            '0x7601': 'SIS',
            '0x7602': '存储阵列',
            '0x7603': '广播控制器',
            '0x7604': '拼接控制器',
            '0x7605': 'LED控制器',
            '0x7606': '门禁控制器',
            '0x7607': '录像机',
            '0x7608': '解码器',
            '0x7609': '信号灯',
            '0x760a': '摄像头',
            '0x760b': '门禁系统',
            '0x760c': 'RF读卡器',
        },
    },
};
